const styles = [
  'font-size: 30px; color: rgb(2, 120, 151); text-decoration: underline;',
  'font-size: 14px; color: rgb(2, 120, 151);',
  'font-size: 14px; color: #fff; background-color: #8AB4F8; border-radius: 35%; padding: 2px;',
  'font-size: 12px; color: rgb(2, 120, 151);',
];

console.log('%cСамооценка', styles[0]);
console.log(
  '%c!Внимание: Если боковые колонки (сортировать, выбери ёлку, игрушки) не помещаются у вас по высоте экрана, и вы не видите часть информации, вы можете прокрутить их скроллом колёсика мыши. Если вы изменили разрешение в ходе работы с сайтом, пожалуйста, перезагрузите сайт. Всё в нём (страница с ёлкой, гирлянды, область навешивания игрушек) подстроится под ваше текущее (на момент перезагрузки страницы) разрешение экрана.',
  styles[1]
);
console.log('%c1. Вёрстка страниц приложения и навигация между ними %c+30', styles[1], styles[2]);
console.log('%c2. Меню с настройками %c+50', styles[1], styles[2]);
console.log('%c3. Гирлянда %c+40', styles[1], styles[2]);
console.log('%c4. Игрушки в избранном %c+80', styles[1], styles[2]);
console.log('%cИтого: 200/220', styles[0]);
console.log(
  '%cНадеюсь вам понравилось моя работа. Если у вас будут замечания, пожалуйста, оставьте свои контактные данные, чтобы я мог связаться с вами как только устроню замечанный вами недочёт.  в дискорд BlackBerryID #3277. Хорошего дня и с наступающим новым годом!',
  styles[3]
);
